# Даны пять чисел a_1, a_2, a_3, a_4, a_5. Напишите программу, которая вычисляет сумму их модулей
num1, num2, num3, num4, num5 = float(input()), float(input()), float(input()), float(input()), float(input())
num_summ = abs(num1) + abs(num2) + abs(num3) + abs(num4) + abs(num5)
print(num_summ)
