# У известного американского писателя Рэя Бредбери есть роман «451 градус по Фаренгейту».
# Напишите программу,которая определяет, какой температуре по шкале Цельсия соответствует
# указанное значение по шкале Фаренгейта.
f_temp = float(input())
c_temp = float(5 / 9 * (f_temp - 32))
print(c_temp)
