# Дано положительное действительное число. Выведите его дробную часть.
num = float(input())
num2 = float(num % 1)
print(num2)
