# Напишите программу, которая считывает с клавиатуры две строки – имя и фамилию пользователя и выводит фразу:
# «Hello [введенное имя] [введенная фамилия]! You just delved into Python»
name = input()
surname = input()
print('Hello', name, surname, '!', '"You just delved into Python"')