# Напишите программу, которая считывает одну строку, после чего выводит «YES»,
# если в введенной строке есть подстрока «синий» и «NO» в противном случае.
strn = input()
if 'синий' in strn:
    print('YES')
else:
    print('NO')
