# Напишите программу, которая считывает с клавиатуры название футбольной команды и выводит фразу:
# «Футбольная команда [введённая строка] имеет длину [длина введённой строки] символов».
ft = input()
print('Футбольная команда', ft, 'имеет длину', len(ft), 'символов')
