# На вход программе подаются три строки: имя, фамилия и отчество. Напишите программу, которая
# выводит инициалы человека.
s_name, s_surname, s_secname = input(), input(), input()
print(s_surname[0], s_name[0], s_secname[0], sep='')
