# На вход программе подается натуральное число n.
# Напишите программу, которая печатает звездный прямоугольник размерами n×19.
star = int(input())
for i in range(star):
    print('*' * 19)
