# Дано предложение и количество раз которое его надо повторить. Напишите программу,
# которая повторяет данное предложение нужное количество раз.
sent = input()
n = int(input())
for w in range(n):
    print(sent)
