"""
Дано натуральное число. Напишите программу, которая вычисляет:

количество цифр 3 в нем;
сколько раз в нем встречается последняя цифра;
количество четных цифр;
сумму его цифр, больших пяти;
произведение цифр, больших семи (если цифр больших семи нет, то вывести 1, если такая цифра одна, то вывести ее);
сколько раз в нем встречается цифры 0 и 5 (всего суммарно).
"""

# num = int(input())
# sum_5, count_3, ld = 0, 0, 0
# prod_7, count_0_5, even_num = 1, 0, 0
# counter_last = num % 10
# while num != 0:
#     fda = num % 10
#     if fda == 3:
#         count_3 += 1
#     if fda == counter_last:
#         ld += 1
#     if fda % 2 == 0:
#         even_num += 1
#     if sum_5 > 5:
#         sum_5 += fda
#     if prod_7 > 7:
#         prod_7 *= fda
#     if fda in (0, 5):
#         count_0_5 += 1
#     num //= 10
# print(count_3, ld, even_num, sum_5, prod_7, count_0_5, sep='\n')

