# Формат входных данных
# На вход программе подаётся три целых числа, каждое на отдельной строке.
#
# Формат выходных данных
# Программа должна вывести сумму введенных чисел.

num1, num2, num3 = int(input()), int(input()), int(input())
summ = num1 + num2 + num3
print(summ)
